Revit 2027 API
Entity(Entity) Constructor
 Constructs a new copy of the input ESEntity object.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Entity(
	Entity other
)
Public Sub New (
	other As Entity
)
public:
Entity(
	Entity^ other
)
new :
        other : Entity -> Entity
Parameters
other Entity
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Entity Class
Entity Overload
Autodesk.Revit.DB.ExtensibleStorage Namespace